backend/controllers/SanphamController.php

    public function actionUpdate($id)
    {
        $model = $this->findModel($id);
        $model->getSeoPost();
        $model->slug = $model->getSlug();
        if ($model->load(Yii::$app->request->post())) {
            PostRelationships::deleteAll(['post_id' => $model->id, 'post_table' => $model->tableName()]);
---
DELETE FROM `post_relationships` WHERE (`post_id`=2) AND (`post_table`='sanpham')

    protected function findModel($id)
    {
        if (($model = Sanpham::findOne($id)) !== null) {
---
SELECT * FROM `sanpham` WHERE `id`='2'