backend/modules/posts/controllers/DefaultController.php

SELECT COUNT(*) FROM `posts` WHERE `type`='post'
SELECT COUNT(*) FROM `posts` WHERE (`status`=2) AND (`type`='post')
SELECT COUNT(*) FROM `posts` WHERE (`status`=1) AND (`type`='post')
SELECT * FROM `trangthai` WHERE `type`='filerindex5'
---
    public function actionIndex($filer = 5,$type = 'post') {
         $searchModel = new PostSearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams, $filer,$type);

        $linkAjax = Url::to(['/posts/default/filerindex']);
        $countAll = Posts::find()->where(['type'=>$type])->count();
        $countNotActive = Posts::find()->where(['status' => Posts::STATUS_DRAFT,'type'=>$type])->count();
        $countTake = Posts::find()->where(['status' =>Posts::STATUS_TRASH,'type'=>$type])->count();
        $arrTitle = [
          ['count'=>$countAll,'title'=>'Tất cả','filer'=>$filer,'type'=>$type],
          ['count'=>$countNotActive,'title'=>'Bản nháp','filer'=>  Posts::STATUS_DRAFT  ,'type'=>$type],
          ['count'=>$countTake,'title'=>'Thùng rác','filer'=>Posts::STATUS_TRASH,'type'=>$type],
        ];
        $dataListAction = ArrayHelper::map(Trangthai::find()->where(['type' => "filerindex".$filer])->all(), 'id', 'ten');

DELETE FROM `post_relationships` WHERE (`post_id`=87) AND (`post_table`='posts')
---
    public function actionUpdate($id) {
        $model = $this->findModel($id);
        $model->getSeoPost();
        $model->slug = $model->getSlug();
        if ($model->load(Yii::$app->request->post())) {
            PostRelationships::deleteAll(['post_id' => $model->id, 'post_table' => Posts::tableName()]);

SELECT * FROM `posts` WHERE `id`='87'
---
    protected function findModel($id) {
        if (($model = Posts::findOne($id)) !== null) {