common/models/BaseDB.php

    function getSeoPost($seo = FALSE) {
        $taxonomy = Taxonomy::findOne(['table_name' => $this->tableName(), 'type' => \common\func\StaticDefine::$SEO_BAI_VIET, 'table_id' => $this->id]);
---
SELECT * FROM `taxonomy` WHERE (`table_name`='sanpham') AND (`type`='SEOBAIVIET') AND (`table_id`=2)

    function getCategories() {
        return $this->hasMany(Category::className(), ['id' => 'table_id'])->viaTable("post_relationships", ['post_id' => 'id'], function ($query) {
            $query->where(['table_name' => 'category', 'post_table' => $this->tableName()]);
        });
---
SELECT * FROM `post_relationships` WHERE ((`table_name`='fbimages') AND (`post_table`='sanpham')) AND (`post_id`=2)

    function getTags() {
        return $this->hasMany(Tags::className(), ['id' => 'table_id'])->viaTable("post_relationships", ['post_id' => 'id'], function ($query) {
            $query->where(['table_name' => 'tags', 'post_table' => $this->tableName()]);
        });
---
SELECT * FROM `post_relationships` WHERE ((`table_name`='category') AND (`post_table`='posts')) AND (`post_id`=87)

    public function getSlug(){
        $model = Slug::findOne(['table_id'=>$this->id,'table_name'=>$this->tableName()]);
---
SELECT * FROM `slug` WHERE (`table_id`=2) AND (`table_name`='sanpham')